bp3.OneSniffer/src/InformationRegisters/ЛогиТрафика/ЛогиТрафика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛогиТрафика</name>
  <resources>
    <name>Метод</name>
    <type>
      <types>EnumRef.МетодHTTP</types>
    </type>
  </resources>
  <resources>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Входящий</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Клиент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодОтвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РазмерОтвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Событие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Содержание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоЗащищенноеСоединение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Разделитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>НомерСеанса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяНачала</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

bp3.OneSniffer/src/Enums/НаправлениеHTTPЛога/НаправлениеHTTPЛога.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НаправлениеHTTPЛога</name>
  <enumValues>
    <name>Входящий</name>
  </enumValues>
  <enumValues>
    <name>Исходящий</name>
  </enumValues>
</mdclass:Enum>

bp3.OneSniffer/src/Enums/НазначениеЛога/НазначениеЛога.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НазначениеЛога</name>
  <enumValues>
    <name>Рабочий</name>
  </enumValues>
  <enumValues>
    <name>Регистр</name>
  </enumValues>
  <enumValues>
    <name>Журнал</name>
  </enumValues>
</mdclass:Enum>

bp3.OneSniffer/src/CommonModules/_HTTPСоединение/Module.bsl
// @strict-types


#Область ПрограммныйИнтерфейс

// Вызвать HTTPМетод.
// 
// Параметры:
//  Соединение - HTTPСоединение
//  Метод - Строка
//  Запрос - HTTPЗапрос
//  ИмяВыходногоФайла - Строка
//  ИмяСобытия - Строка
// 
// Возвращаемое значение:
//  HTTPОтвет
//
Функция _ВызватьHTTPМетод(Знач Соединение, Знач Метод, Знач Запрос, Знач ИмяВыходногоФайла = "", ИмяСобытия = "") Экспорт
	
	// Если логирование не используется, то делаем ровно то, что было бы сделано без расширения, без перехвата исключений.
	НастройкиЛогирования = ЛогированиеТрафика.ЗагрузитьНастройкиЛогирования();
	Если Не НастройкиЛогирования.ВключеноЛогирование Тогда
		
		Если ПустаяСтрока(ИмяВыходногоФайла) Тогда
			HTTPОтвет = Соединение.ВызватьHTTPМетод(Метод, Запрос); // HTTPОтвет
		Иначе
			HTTPОтвет = Соединение.ВызватьHTTPМетод(Метод, Запрос, ИмяВыходногоФайла); // HTTPОтвет
		КонецЕсли;
		
		Возврат HTTPОтвет;
		
	КонецЕсли;
	
	ПараметрыЛога = Новый Структура;
	ПараметрыЛога.Вставить("Соединение", Соединение);
	ПараметрыЛога.Вставить("HTTPЗапрос", Запрос);
	ПараметрыЛога.Вставить("ИмяМетода", Метод);
	ПараметрыЛога.Вставить("ИмяСобытия", ИмяСобытия);
	ЛогЗапроса = РегистрыСведений.ЛогиТрафика.НовыйЛог(
		Перечисления.НаправлениеHTTPЛога.Исходящий,
		Перечисления.НазначениеЛога.Рабочий,
		ПараметрыЛога);
	ЛогированиеТрафика.ИмяСобытия(ЛогЗапроса.Событие, Запрос.АдресРесурса);
	
	Попытка
		
		Если ПустаяСтрока(ИмяВыходногоФайла) Тогда
			HTTPОтвет = Соединение.ВызватьHTTPМетод(Метод, Запрос); // HTTPОтвет
		Иначе
			HTTPОтвет = Соединение.ВызватьHTTPМетод(Метод, Запрос, ИмяВыходногоФайла); // HTTPОтвет
		КонецЕсли;
		
		ЛогЗапроса.Вставить("HTTPОтвет", HTTPОтвет);
		
	Исключение
		
		// Запишем в лог текст самого исключения.
		Комментарий = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Если НастройкиЛогирования.ЗаписыватьВРСТело Тогда
			ЛогЗапроса.Содержание.ТелоОтвета = Комментарий;
		КонецЕсли;
		
		// Подготовим данные для записи в журнал регистрации.
		ДанныеДляЗаписи = ЛогированиеТрафика.ДанныеДляЗаписиВЖурналРегистрации(ЛогЗапроса);
		
		ЗаписьЖурналаРегистрации(
			ЛогированиеТрафика.СобытиеВызватьHTTPМетод(), 
			УровеньЖурналаРегистрации.Ошибка,, 
			ДанныеДляЗаписи, 
			Комментарий);
		
		Если Не ТранзакцияАктивна() 
			И НастройкиЛогирования.ЗаписыватьВРС Тогда
			
			// Запись лога вне транзакции
			РегистрыСведений.ЛогиТрафика.ЗаписатьЛог(ЛогЗапроса, ИмяВыходногоФайла);
			
		КонецЕсли;
		
		ВызватьИсключение;
		
	КонецПопытки;
	
	Если НастройкиЛогирования.ЗаписыватьВЖР Тогда
		
		ДанныеДляЗаписи = ЛогированиеТрафика.ДанныеДляЗаписиВЖурналРегистрации(ЛогЗапроса);
		КомментарийЖурнала = ЛогированиеТрафика.КомментарийЗаписиЖурналаHTTP(ЛогЗапроса);
		
		ЗаписьЖурналаРегистрации(
			ЛогированиеТрафика.СобытиеВызватьHTTPМетод(), 
			УровеньЖурналаРегистрации.Информация,, 
			ДанныеДляЗаписи, 
			КомментарийЖурнала);
		
	КонецЕсли;
	
	Если НастройкиЛогирования.ЗаписыватьВРС Тогда
		РегистрыСведений.ЛогиТрафика.ЗаписатьЛог(ЛогЗапроса, ИмяВыходногоФайла);
	КонецЕсли;
	
	Возврат ЛогЗапроса.HTTPОтвет;
	
КонецФункции

#КонецОбласти
